<a href="https://colab.research.google.com/github/Aldbow/kmb_aldiva/blob/main/Session_14_DB_Programming_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Write and Read File in Python**

In [ ]:
import os

In [ ]:
print(os.getcwd())

/Users/farhanrezagumay/Downloads/Data Science/Digital Skola/Course Material/Script

In [ ]:
writefile = open('example.txt','w')
writefile.write("Welcome to Digital Skola")
writefile.close()

In [ ]:
readfile = open('example.txt','r')
print(readfile.read())
readfile.close()

Welcome to Digital Skola

In [ ]:
with open('example.txt','r') as readfile:
  print(readfile.read())

Welcome to Digital Skola

In [ ]:
with open('example.txt','w') as writefile:
  writefile.write('Ini baris 1\n')
  writefile.write('Ini baris 2\n')

In [ ]:
with open('example.txt','r') as readfile:
  print(readfile.read())

Ini baris 1
Ini baris 2

In [ ]:
with open('example.txt','a') as appendfile:
  appendfile.write('Ini barus 3\n')

# **Database Connection**

In [ ]:
pip install psycopg2

Collecting psycopg2
  Downloading psycopg2-2.9.1.tar.gz (379 kB)
     |████████████████████████████████| 379 kB 1.0 MB/s eta 0:00:01
    ERROR: Command errored out with exit status 1:
     command: /Users/farhanrezagumay/opt/anaconda3/bin/python -c 'import sys, setuptools, tokenize; sys.argv[0] = '"'"'/private/var/folders/ty/y5kprs3n3xsbfb4c52x2jw1h0000gn/T/pip-install-cj0p2i8a/psycopg2/setup.py'"'"'; __file__='"'"'/private/var/folders/ty/y5kprs3n3xsbfb4c52x2jw1h0000gn/T/pip-install-cj0p2i8a/psycopg2/setup.py'"'"';f=getattr(tokenize, '"'"'open'"'"', open)(__file__);code=f.read().replace('"'"'\r\n'"'"', '"'"'\n'"'"');f.close();exec(compile(code, __file__, '"'"'exec'"'"'))' egg_info --egg-base /private/var/folders/ty/y5kprs3n3xsbfb4c52x2jw1h0000gn/T/pip-install-cj0p2i8a/psycopg2/pip-egg-info
         cwd: /private/var/folders/ty/y5kprs3n3xsbfb4c52x2jw1h0000gn/T/pip-install-cj0p2i8a/psycopg2/
    Complete output (23 lines):
    running egg_info
    creating /private/var/folders/ty/y5kprs3n3xsbfb4c52x2jw1h0000gn/T/pip-install-cj0p2i8a/psycopg2/pip-egg-info/psycopg2.egg-info
    writing /private/var/folders/ty/y5kprs3n3xsbfb4c52x2jw1h0000gn/T/pip-install-cj0p2i8a/psycopg2/pip-egg-info/psycopg2.egg-info/PKG-INFO
    writing dependency_links to /private/var/folders/ty/y5kprs3n3xsbfb4c52x2jw1h0000gn/T/pip-install-cj0p2i8a/psycopg2/pip-egg-info/psycopg2.egg-info/dependency_links.txt
    writing top-level names to /private/var/folders/ty/y5kprs3n3xsbfb4c52x2jw1h0000gn/T/pip-install-cj0p2i8a/psycopg2/pip-egg-info/psycopg2.egg-info/top_level.txt
    writing manifest file '/private/var/folders/ty/y5kprs3n3xsbfb4c52x2jw1h0000gn/T/pip-install-cj0p2i8a/psycopg2/pip-egg-info/psycopg2.egg-info/SOURCES.txt'

    Error: pg_config executable not found.

    pg_config is required to build psycopg2 from source.  Please add the directory
    containing pg_config to the $PATH or specify the full executable path with the
    option:

        python setup.py build_ext --pg-config /path/to/pg_config build ...

    or with the pg_config option in 'setup.cfg'.

    If you prefer to avoid building psycopg2 from source, please install the PyPI
    'psycopg2-binary' package instead.

    For further information please check the 'doc/src/install.rst' file (also at
    <https://www.psycopg.org/docs/install.html>).

    ----------------------------------------
ERROR: Command errored out with exit status 1: python setup.py egg_info Check the logs for full command output.
Note: you may need to restart the kernel to use updated packages.

In [ ]:
import sys
!conda install --yes --prefix {sys.prefix} <psycopg2>

/bin/sh: -c: line 0: syntax error near unexpected token `newline'
/bin/sh: -c: line 0: `conda install --yes --prefix /Users/farhanrezagumay/opt/anaconda3 <psycopg2>'

In [ ]:
import psycopg2

#connection database
conn = psycopg2.connect(
        host = "digitalskoladb.c04me33o8tni.ap-southeast-1.rds.amazonaws.com",
        port = 5432,
        database= "sandbox",
        user = "group_a",
        password = "hZrJQJ8RMttts9VZnUYZX93pr")

#creating object using the cursor method
cursor = conn.cursor()

ModuleNotFoundError: No module named 'psycopg2'

# **Create Table**

In [ ]:
conn = psycopg2.connect(
        host = "digitalskoladb.c04me33o8tni.ap-southeast-1.rds.amazonaws.com",
        port = 5432,
        database= "sandbox",
        user = "group_a",
        password = "hZrJQJ8RMttts9VZnUYZX93pr")

#creating object using the cursor method
cursor = conn.cursor()

cursor.execute("DROP TABLE IF EXISTS sandbox.batch_2.bus")

sql = '''
      create table sandbox.batch_2.bus (
      id int,
      origin varchar,
      destination varchar,
      time time
)'''

cursor.execute(sql)
print("Table created successfully..")

conn.commit()

conn.close()

Table created successfully..

# **Insert Data**

In [ ]:
conn = psycopg2.connect(
        host = "digitalskoladb.c04me33o8tni.ap-southeast-1.rds.amazonaws.com",
        port = 5432,
        database= "sandbox",
        user = "group_a",
        password = "hZrJQJ8RMttts9VZnUYZX93pr")

#creating object using the cursor method
cursor = conn.cursor()

sql ='''insert into sandbox.batch_2.bus values 
        (100, 'Jakarta', 'Bandung', '10:00'),
        (200, 'Jakarta', 'Palembang', '11:00'),
        (300, 'Jakarta', 'Jogja', '12:00')'''

cursor.execute(sql)

conn.commit()
print("Data inserted successfully..")

conn.close()

Data inserted successfully..

# **Select Data**

In [ ]:
conn = psycopg2.connect(
        host = "digitalskoladb.c04me33o8tni.ap-southeast-1.rds.amazonaws.com",
        port = 5432,
        database= "sandbox",
        user = "group_a",
        password = "hZrJQJ8RMttts9VZnUYZX93pr")

#creating object using the cursor method
cursor = conn.cursor()

sql ='''select * from sandbox.batch_2.bus'''

cursor.execute(sql)

result = cursor.fetchall();
print(result)

conn.commit()

conn.close()

[(100, 'Jakarta', 'Bandung', datetime.time(10, 0)), (200, 'Jakarta', 'Palembang', datetime.time(11, 0)), (300, 'Jakarta', 'Jogja', datetime.time(12, 0))]

Or We can select data using pandas

In [ ]:
import pandas as pd

In [ ]:
conn = psycopg2.connect(
        host = "digitalskoladb.c04me33o8tni.ap-southeast-1.rds.amazonaws.com",
        port = 5432,
        database= "sandbox",
        user = "group_a",
        password = "hZrJQJ8RMttts9VZnUYZX93pr")

In [ ]:
sql = '''
      select * 
      from sandbox.datasource.employees e
      join sandbox.datasource.departments d on e.department_id = d.department_id

'''

In [ ]:
df = pd.read_sql(sql, con=conn)

In [ ]:
df.head()

   employee_id first_name last_name  ... department_name manager_id location_id
0        100.0     Steven      King  ...       Executive      100.0      1700.0
1        101.0      Neena   Kochhar  ...       Executive      100.0      1700.0
2        102.0        Lex   De Haan  ...       Executive      100.0      1700.0
3        103.0  Alexander    Hunold  ...              IT      103.0      1400.0
4        104.0      Bruce     Ernst  ...              IT      103.0      1400.0

[5 rows x 15 columns]

# **Update Table**

In [ ]:
conn = psycopg2.connect(
        host = "digitalskoladb.c04me33o8tni.ap-southeast-1.rds.amazonaws.com",
        port = 5432,
        database= "sandbox",
        user = "group_a",
        password = "hZrJQJ8RMttts9VZnUYZX93pr")

#creating object using the cursor method
cursor = conn.cursor()

print('Data sebelum diupdate')
sql = '''
      select * from sandbox.batch_2.bus
'''
cursor.execute(sql)
print(cursor.fetchall())


print('Data sesudah diupdate')
sql = '''
      update sandbox.batch_2.bus
      set id = 100, origin = 'Medan', destination = 'Bandung', time = '10:00'
      where id = 100 
    '''
cursor.execute(sql)

sql = '''
      select * from sandbox.batch_2.bus
'''
cursor.execute(sql)
print(cursor.fetchall())

conn.commit()

conn.close()

Data sebelum diupdate
[(200, 'Jakarta', 'Palembang', datetime.time(11, 0)), (300, 'Jakarta', 'Jogja', datetime.time(12, 0)), (100, 'Aceh', 'Bandung', datetime.time(10, 0))]
Data sesudah diupdate
[(200, 'Jakarta', 'Palembang', datetime.time(11, 0)), (300, 'Jakarta', 'Jogja', datetime.time(12, 0)), (100, 'Medan', 'Bandung', datetime.time(10, 0))]

# **Delete Data**

In [ ]:
conn = psycopg2.connect(
        host = "digitalskoladb.c04me33o8tni.ap-southeast-1.rds.amazonaws.com",
        port = 5432,
        database= "sandbox",
        user = "group_a",
        password = "hZrJQJ8RMttts9VZnUYZX93pr")

#creating object using the cursor method
cursor = conn.cursor()

print('Data sebelum didelete')
sql = '''
      select * from sandbox.batch_2.bus
'''
cursor.execute(sql)
print(cursor.fetchall())

print('Data sesudah didelete')
sql = '''
      delete from sandbox.batch_2.bus where id = 100
    '''
cursor.execute(sql)

sql = '''
      select * from sandbox.batch_2.bus
'''
cursor.execute(sql)
print(cursor.fetchall())

conn.commit()

conn.close()

Data sebelum didelete
[(200, 'Jakarta', 'Palembang', datetime.time(11, 0)), (300, 'Jakarta', 'Jogja', datetime.time(12, 0)), (100, 'Medan', 'Bandung', datetime.time(10, 0))]
Data sesudah didelete
[(200, 'Jakarta', 'Palembang', datetime.time(11, 0)), (300, 'Jakarta', 'Jogja', datetime.time(12, 0))]

# **Drop Table**

In [ ]:
conn = psycopg2.connect(
        host = "digitalskoladb.c04me33o8tni.ap-southeast-1.rds.amazonaws.com",
        port = 5432,
        database= "sandbox",
        user = "group_a",
        password = "hZrJQJ8RMttts9VZnUYZX93pr")

#creating object using the cursor method
cursor = conn.cursor()

sql = '''
      drop table sandbox.batch_2.bus
'''

cursor.execute(sql)
print("Table sudah dihapus")

conn.commit()

conn.close()

Table sudah dihapus

# **How to Query from CSV**

In [ ]:
!pip install sqldf
import sqldf
import pandas as pd

Requirement already satisfied: sqldf in /usr/local/lib/python3.7/dist-packages (0.4.2)

In [ ]:
california_housing = pd.read_csv('sample_data/california_housing_test.csv')
california_train = pd.read_csv('sample_data/california_housing_train.csv')

In [ ]:
california_housing

      longitude  latitude  ...  median_income  median_house_value
0       -122.05     37.37  ...         6.6085            344700.0
1       -118.30     34.26  ...         3.5990            176500.0
2       -117.81     33.78  ...         5.7934            270500.0
3       -118.36     33.82  ...         6.1359            330000.0
4       -119.67     36.33  ...         2.9375             81700.0
...         ...       ...  ...            ...                 ...
2995    -119.86     34.42  ...         1.1790            225000.0
2996    -118.14     34.06  ...         3.3906            237200.0
2997    -119.70     36.30  ...         2.2895             62000.0
2998    -117.12     34.10  ...         3.2708            162500.0
2999    -119.63     34.42  ...         8.5608            500001.0

[3000 rows x 9 columns]

In [ ]:
sql = '''
      select a.longitude, a.latitude, b.longitude
      from california_housing as a
      join california_train as b on a.longitude = b.longitude
'''

In [ ]:
df = sqldf.run(sql)

In [ ]:
df

        longitude  latitude  longitude
0         -122.05     37.37    -122.05
1         -122.05     37.37    -122.05
2         -122.05     37.37    -122.05
3         -122.05     37.37    -122.05
4         -122.05     37.37    -122.05
...           ...       ...        ...
152545    -119.63     34.42    -119.63
152546    -119.63     34.42    -119.63
152547    -119.63     34.42    -119.63
152548    -119.63     34.42    -119.63
152549    -119.63     34.42    -119.63

[152550 rows x 3 columns]